// Дана последовательность температурных колебаний:
//-25.4, -27.0 13.0, 19.0, 15.5, 24.5, -21.0, 32.5.
//Объединить данные значения в группы с шагом в 10 градусов.
//Последовательность в подмножноствах не важна.
//
//Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.

package main

import (
	"fmt"
	"math"
)

func main() {
	//v := []float64{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5, 4.9, -0.9, 0.0}

	v := []float64{-25.0, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0}

	res := make(map[int][]float64)

	for _, n := range v {
		var tmp int
		if math.Signbit(n) { // Проверка знака температуры
			tmp = ((int(math.Abs(n))) / 10) * 10 * -1
		} else { // для вычисления ключа модуль числа округляется вниз, обнуляется посленгий разряд
			// и восстанавливается знак
			tmp = ((int(math.Abs(n))) / 10) * 10
		}

		res[tmp] = append(res[tmp], n)
	}

	fmt.Println(res)
}
